Autodesk.Revit.DB.IFC.IFCTransaction.#ctor(Autodesk.Revit.DB.IFC.IFCFile)
Instantiates a transaction object.
Remarks:
The transaction starts by creating a transaction object.
file:
The IFC file for which this transaction is going to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012